public class Main {
    public static void main(String[] args) {
        /*
        * Элестетип корунуздор,
сиздер маркеттен соода кылып жатасыздар.
Бир канча бара турган маркеттердин списогу болсун.
Маркетте ала турган товарлардын списогу болсун жана баалары болсун.
Анан маркеттен соода кылган сон бизге кадимкидей чек чыгып берсин.
~~~~~~ Чек ~~~~~~~~
Ким алды: "Аты"
Кайсыл маркеттен алды: "Маркет"
Список товаров: Банан, Молоко, Сыр, ...
Общая стоимость товаров:
Скидка: "Если есть акции"
Общая стоимость после скидки:
~~~~~~~~~~~~~~~~~~~
Спасибо за покупку!
Фантазияны иштетип, дагы да методторду кошсонуздар болот,
жана да кооздоп, кызыктуу логикаларды да кошсонуздар болот.
Подсказка 2 класс продуктулар enum болсун, Продуктаны сатып
* алган адамдын акчасы азайып магазиндин акчасы кобоюшу керек.Жок дегенде 10 метод ойлоп жазыныздар.*/
    }
}